# Getting Started with Pandas

pandas will be a major tool of interest throughout much of the rest of the notebook. It contains data structures and data manipulation tools designed to make data cleaning and analysis fast and convenient in Python. pandas is often used in tandem with numerical computing tools like NumPy and SciPy, analytical librairies like tatsmodels and scikit-learn, and data vizualization librairies like matplotlib. pandas adopts significant part of NumPy's idiomatic style of array-based computing, especially array-based functions and a preference for data processing without for loops.


Thoughout the rest of the book, I use the following import convention for Numpy and Pandas:

In [1]:
!pip install pandas numpy

Requirement already satisfied: pandas in /Users/CORENTIN/data-corentinv/ensp-data-analysis-univ-lille/venv/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: numpy in /Users/CORENTIN/data-corentinv/ensp-data-analysis-univ-lille/venv/lib/python3.10/site-packages (1.24.1)
Requirement already satisfied: pytz>=2020.1 in /Users/CORENTIN/data-corentinv/ensp-data-analysis-univ-lille/venv/lib/python3.10/site-packages (from pandas) (2022.7)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/CORENTIN/data-corentinv/ensp-data-analysis-univ-lille/venv/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/CORENTIN/data-corentinv/ensp-data-analysis-univ-lille/venv/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import numpy as np
import pandas as pd

## 1. Data Structure

To get Started with pandas, you will need to get comfortable with its twi workhorse data structures: Series and DataFrame. While they are not a universal solution for every problem, they provide a solid foundation for a wide variety of data tasks.

### Series

A Series is a one-dimensional array-like object containing a sequence of values for similar types to NumPy types) of the same type and an associated array of data labels called its index. The simplest Series is formated from onlu an array of data.

In [5]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

The string representation of a Series displayed interactively whows the index on the left and the values on the right. Since we did not specify an index for the data, a default one consisting of the integers 0 though N-1 (where N is the length of the data) is created. You can get the array representation and index object of the Series via its array and index attributes, respectively:

In [7]:
print(f"Array: {obj.array}") # result is a Pandas Array which usually wraps a NumPy array 
print(f"Index: {obj.index}")

Array: <PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64
Index: RangeIndex(start=0, stop=4, step=1)

In [14]:
# Often you'll want to create a Series with an index identifying each data point with a label
obj2 = pd.Series([4,7,-5,4], index=["d","b", "a", "c"])
obj2

d    4
b    7
a   -5
c    4
dtype: int64

In [15]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
# Compared with NumPy arrays, you can use labels in the index when selecting single values or a set of values:
obj2["a"]

-5

Using NumPy functions or NumPy-like operations, such as filtering with a Boolean array, scalar multiplication, or applying math functions, will preserve the index-value link

In [19]:
obj2>0

d    False
b    False
a     True
c    False
dtype: bool

In [20]:
obj2[obj2>0]

d    4
b    7
c    4
dtype: int64

In [21]:
obj2 * 2

d     8
b    14
a   -10
c     8
dtype: int64

Should you have data contained in a Python dictionnary, you can create a Series from it by passing the dictionnary

In [33]:
sdata = {'Ohio': 3500, "Texas": 71000, "Oregon":16000}
obj3 = pd.Series(sdata)
obj3

Ohio       3500
Texas     71000
Oregon    16000
dtype: int64

And a Serie can be converted back to a dictionnary with its to_dict method:

In [35]:
obj3.to_dict()

{'Ohio': 3500, 'Texas': 71000, 'Oregon': 16000}

In [22]:
?pd.Series

### DataFrame

A DataFrame represents a rectangular table of data and contains an ordered, names collection of columns, each of which can be a different value type (numeric, string, Boolean, etc.). The DataFrame has both a row and columns index; it can be thought of as a dictionnary of Series all sharing the same index.

The are many ways to construct a DataFrame, though one of the most common is from a dictionary of equal-length lists or NumPy arrays:

In [42]:
data = {"state": ["Ohio", "Ohio", "Nevada", "Nevada"], 
       "year": [2000,2001, 2001, 2002],
        "pop": [1.5,1.7,3.6,2.4]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2  Nevada  2001  3.6
3  Nevada  2002  2.4

For large DataFrames, the head method selects only the first five rows and tail return the last five rows

In [27]:
# frame.head(2)
frame.tail(2)

    state  year  pop
2  Nevada  2001  3.6
3  Nevada  2002  2.4

A columns in a DataFrame can be retrieved as a Series either by dictionnary-like notation or by using the dot attribute notation

In [37]:
frame['state']

0      Ohio
1      Ohio
2    Nevada
3    Nevada
Name: state, dtype: object

In [33]:
type(frame['state'])

pandas.core.series.Series

    NB: Attribute-like acess (e.g. frame.year) and tab completion of column names in IPython are provided as convenience.

    frame[column] works for any column column name, but frame2.column works only when the column name is a valid Python variable name and does not conflict with any of the method names in DataFrame.
    For example of a columns's name contains whitespace or symbols other than underscores it cannot be accessed with the dot attribute method.

Note that the returned Series have the same index as the DataFrame and their name attribute has been appropriately set.
Rows can also be retrieved by position or name with the special iloc and loc attributes.

In [43]:
frame2 = frame.copy()
frame2.index = ["a", 'b', 'c', 'd']
frame2.head()

    state  year  pop
a    Ohio  2000  1.5
b    Ohio  2001  1.7
c  Nevada  2001  3.6
d  Nevada  2002  2.4

In [44]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2  Nevada  2001  3.6
3  Nevada  2002  2.4

In [57]:
frame2.loc['a'] # loc prend en argument un index

state    Ohio
year     2000
pop       1.5
Name: a, dtype: object

In [47]:
frame.iloc[2]  # ne s'appuie pas sur les index

state    Nevada
year       2001
pop         3.6
Name: 2, dtype: object

Warning: columns can be modified by assignment. For exemple the empty debt columns could be assigned a scalar value or an array of values.

In [49]:
frame["debt"] = 16.5
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2  Nevada  2001  3.6  16.5
3  Nevada  2002  2.4  16.5

In [51]:
frame["debt"] = np.arange(4.)
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2  Nevada  2001  3.6   2.0
3  Nevada  2002  2.4   3.0

a

You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array

In [52]:
frame.T

          0     1       2       3
state  Ohio  Ohio  Nevada  Nevada
year   2000  2001    2001    2002
pop     1.5   1.7     3.6     2.4
debt    0.0   1.0     2.0     3.0

### Index

pandas's index objects are responsible for holding the axis labels (including a DataFrame's columns names) and other metadata (like the axis name or names). Any array or other sequence of labels you use when constructing a Series or DataFrame is internally converted to an Index.

In [65]:
obj = pd.Series(np.arange(3), index=["a","b","c"])
obj.index[1]

'b'

In [66]:
# Index objects are immutable and this cannot be modified by the user:
obj.index[1] = "d" # --> NameError

TypeError: Index does not support mutable operations

## 2. Essential Functionnality
This section will walk you through the fundamental mechanics of interacting with the data contained in a Series of DataFrame. In the chapters to come, we will delve more deeply into data analysis and manipulation topics using pandas. This notebook not intended to serve as exhaustive documentation for the pandas library; instead we will focus on familiarizing you with heavily used features, leaving the less common things for you to learn more about by reading the online pandas documentation

### Reindexing

An important method on pandas object is reindex, which means to create new object with the values rearranged to align with the new index. Consider an example.
Calling reindex on this Series rearranges the data according to the new index introducing missing values if any index values were not already present:

In [63]:
obj2 = obj.reindex(["b","c", "j"])
obj2

b    1.0
c    2.0
j    NaN
dtype: float64

For ordered data like time series, you may want to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a method such as ffill, which forward-fills the values:

In [67]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [68]:
obj3.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter the (row) index, columns or both. When passed only a sequence, it reindexes the rows in the result

In [70]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=["a", "c", "d"], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [71]:
frame2 = frame.reindex(index=["a", "b","c","d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

This columns can be reindexed with the columns keywords

In [73]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)
# Because "Ohio" is not in states, the data for that column is dropped from the result.

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis
Dropping one or more entries from an axis is simple if you already have an index array or list without those entries, since you can use the reindex method or .loc based indexing. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis.

In [74]:
obj = pd.Series (np.arange(5.), index=["a","b","c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [76]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis. To illustrate this, we first create an example of DataFrame:

In [78]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
# Calling drop with a sequence of labels will drop values from the row labels (axis 0)
data.drop(index=['Colorado', 'Ohio'])

# To drop labels from the columns, instead use the columns keyword
data.drop(columns=['two'])

# You can also drop values from the columns by passing axis=1 (which is like NumPy) or axis='columns'
data.drop('two', axis=1)
data.drop(['two','four'], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Index Selection and Filtering
Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Serie's index values instead of only integers. Here are some examples of this:

In [86]:
data[data.one<2]

      one  two  three  four
Ohio    0    1      2     3

While you can select data by label this way, the preferred way to select index values is with the special loc operator

In [88]:
data.loc[['Ohio']]

      one  two  three  four
Ohio    0    1      2     3

The reason to prefer loc is because of the different treatment of integers whn indexing with []. Regular []-based indexing will treat integers as labels if the index contains integers, so the behavior differs depending on the data type of the index. For contains integers so the behavior differs depending on the data type of the index. For example:

In [91]:
obj1 = pd.Series([1,2,3], index=[2,0,1])
obj2 = pd.Series([1,2,3], index=['a','b','c'])
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [92]:
obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [94]:
# obj2.loc[[0,1,2]] # --> KeyError
# When using loc, the expression obj.loc[[0,1,2]] will fail when the index does not contain intergers

Since loc operator indexes exclusively with labels, there is also an iloc operator that indexes exclusively with integers to work consistently whether or not the index contains integers:

In [95]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

Like-Series DataFrame have special attributes
* df[columns]        : Select single columns or sequence of columns from the DataFrame ; special case conveniences: Boolean array (filter row) or Boolean DataFrame (set values based on some criterion)
* df.loc[rows]       : Select single row or subset of rows from the DataFrame by label
* df.loc[:,cols]     : Select single columns or subset of columns by label
* df.loc[rows, cols] : Select both row(s) and column(s) by label
* df.iloc[rows]      : Select single row or subset of rows from the DataFrame by integer position
* df.iloc[:, cols]   : Select single column or subset of columns by integer position
* reindex method     : Select either rows or colunms by labels

### Function Application and Mapping

NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [97]:
frame = pd.DataFrame(np.random.standard_normal((4,3)), columns=list("bde"), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.238077  0.058074  0.845568
Ohio   -0.765497 -1.585771  1.192300
Texas  -0.378840  0.537418 -1.247469
Oregon  0.282294 -1.592376 -0.324384

In [98]:
np.abs(frame)

               b         d         e
Utah    0.238077  0.058074  0.845568
Ohio    0.765497  1.585771  1.192300
Texas   0.378840  0.537418  1.247469
Oregon  0.282294  1.592376  0.324384

Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame's apply method does exactly this

In [99]:
def f1(x):
    return x.max() - x.min()
frame.apply(f1)

b    1.047790
d    2.129794
e    2.439769
dtype: float64

Here the function f, which computes the difference between the maximum and minimum of Series, is invoked once on each columns in frame. The result is a Series having the columns of frame as its index.
If you pass axis="columns" to apply, the function will be invoked once per row instead. A helpful way to think about this is as "apply across the columns"

In [100]:
frame.apply(f1, axis="columns")

Utah      1.083645
Ohio      2.778070
Texas     1.784887
Oregon    1.874670
dtype: float64

Many of the most common array statistics (like sum of mean) are DataFrame methods so using apply is not necessary. 
The function passed to apply need not return a scalar value; it can also return a Series with multiple values

In [101]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f2)

            b         d         e
min -0.765497 -1.592376 -1.247469
max  0.282294  0.537418  1.192300

### Sorting and Ranking

Sorting a dataset by some criterion is another important built-in operation. To sort lexicographically by row or columns label, use the sort_index method, which returns a new, sorted object:

In [103]:
obj = pd.Series(np.arange(4), index=["d","a","b","c"])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [104]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [105]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

The data can be sorted in descending order:

In [108]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

## 3. Summarizing and Computing Descriptive Statistics
pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series, or a Series o f values from the rows or columns of a DataFrame. Compared with the similar methods found on NumPy arrays, they have built-in handling for missing data. Consider a small DataFrame

In [110]:
df = pd.DataFrame([[1.4, np.nan], [7.1,-4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [111]:
df.sum() # calling DataFrame's sum method returns a Series containing columns sums

one    9.25
two   -5.80
dtype: float64

In [113]:
df.sum(axis="columns") # Passing axis="columns" or axis=1 sums across the columns instead

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [116]:
df.sum(axis="columns", skipna=False) # When an entire row or columns contains NA values, the sum 0 whereas if any value is not NA, then the result is NA. 
# This can bedisabled with the skipna option, o, which case any NA value in a row or columns names the corresponding result NA

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [118]:
# Some Aggregation like mean require at least one non-NA value to yield a value result, so here we have
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

Some Descriptive and summary statistics
* count : Number of non-NA values
* describe : Compute set of summary statistics
* min, max : compute minimum and maximum values
* quantile : compute sample quantile ranging from 0 to 1 (default 0.5)
* sum : sum of values
* mean or median : mean of arithmetic median (50% quantile) of values
* std : Sample standard deviation of values
* cumsum : Cumulative sum of values

### Correlation and Covariance
cf. TP titanic

### Unique Values and Value Counts
Another class of related methods extracts information about the values contained in a one-dimensional Series. To illustrate these, consider this example:

In [121]:
obj = pd.Series(['c','a','d', 'a','a', 'b', 'b', 'c', 'a'])

In [122]:
uniques = obj.unique() # unique will give you an array of the unique values in a Series
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [123]:
obj.value_counts()

a    4
c    2
b    2
d    1
dtype: int64

## 4. Data Loading, Storage and File Formats
Reading data and making it accessible (often called data loading) is a nescessary first step for using most of the tools in this notebook. The term parsing is also sometimes used to describe loading text data and interpreting it as tables and different data types.

Pandas features a number of functions for reading tabular data as a DataFrame object. We summarize sime of them : pandas.read_csv is one of the most frequently used function.

* read_csv : load delimited data from a file, URL, or file-like object use comma as default delimiter
* read_fwf : Read data in fixed-width columns format (i.e. no delimiters)
* read_excel : read tabular data from an excel XLS or XLSX file
* read_html : read all tables found in the given HTML document 
* read_json : read data from a JSON (Javascript Object Notation) string representation, file URL or file-like object
* read_parquet : read the Apache paruqet binary file format
* read_pickle : read an object stored by pandas using the python pickle format
* read_sas : read a SAS dataset stored in one of the SAS System's custom storage formats
* read sql : read the results of a SQL query (using SQLAlchemy)
* read_sql_table : Read a whole SQL table (using SQLAlchemy) equivalent to using a query that selects everythingin that table using read_sql
* read_xml : read a table of data from an XML file

In [125]:
# -> cf. TP titanic

### Interacting with web API

Many websites have public APIs providing data feeds via JSON or some other format. There are number of ways to access these APIs from Python; one method that I recommend is the requests package, which can be installed with pip.

In [130]:
import requests

In [132]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"
resp = requests.get(url)
resp

In [135]:
data = resp.json()
data[0]["title"]

'BUG: Complex Numbers Not Imported Correctly Under JSON Read'

In [138]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", 'state'])
issues.head(2)

,number,title,labels,state
0,50782,BUG: Complex Numbers Not Imported Correctly Un...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,50781,DEPR: remove Int/Uint/Float64Index from pandas...,[],open

### Interacting with Databases
In a business setting, a lot of data may not be stored in text of Excel files. SQL-based relational databases (such as SQL Server, PostgressQL, MySQL) are in wide use, and many alternative databases have become quite popular. The choice of database is usually dependent on the performance, data integrity and scalability needs of an application. 

pandas has some functions to simplify loading the results of a SQL query into a DataFrame. As an example, I'll create a SQLite3 database using Python's built-in sqlite3 drive:

In [139]:
import sqlite3

In [140]:
query = "CREATE TABLE test (a VARCHAT(20), b VARCHAR(20),c REAL, d INTEGER);"

In [141]:
conn = sqlite3.connect('mydata.sqlite')

In [142]:
conn.execute(query)

In [144]:
conn.commit()

In [145]:
data = [("Atlanta", 'Georgia', 1.25 , 6),
       ("Tallahasse", 'Florida', 2.6 , 3),
       ("Sacramento", 'California', 1.7,  5)]

In [147]:
stmt = "INSERT INTO test values(?,?,?,?)"
conn.executemany(stmt, data)

In [148]:
conn.commit()

In [149]:
cursor = conn.execute('SELECT * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [150]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5

This is quite a bi of munging that you'd rather not repeat each time you query the database. The SQLAlchemy project is a popular Python SQL toolkit that abstracts away many of the common differences between SQL databases. pandas has a read_sql functiuon that enables you to read data easily from a general SQLAlchemy connection. You can install SQLAlchemy wich conda or pip.

In [154]:
import sqlalchemy as sqla
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [155]:
pd.read_sql('SELECT * FROM test', db)

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5